TexasInstruments/c2000ware-core-sdk/libraries/control/DCL/c28/examples/F280049_ERAD/f28004x_dcl_erad.c
//***********************************************************************************
//
//ERAD_HWBPConfig -	This function is used to configure the Enhanced Bus comparator unit. 
//					Inputs can be HWBP1_INST, HWBP2_INST etc and the 
//					configurations can be passed via a structure of type hwbpConfig.
//
//***********************************************************************************
void ERAD_HWBPConfig(Uint16 hwbpInstance,hwbpConfig hwbpCfg)
{
	EALLOW;
	if(hwbpInstance == HWBP1_INST)
	{
		EradHWBP1Regs.HWBP_CNTL.bit.BUS_SEL 	= hwbpCfg.BUS_SEL;
		EradHWBP1Regs.HWBP_CNTL.bit.COMP_MODE 	= hwbpCfg.COMP_MODE;
		EradHWBP1Regs.HWBP_REF 				= hwbpCfg.REF;
		EradHWBP1Regs.HWBP_MASK 				= hwbpCfg.MASK;
		EradHWBP1Regs.HWBP_CNTL.bit.STOP 		= hwbpCfg.DBGEVT;
		EradHWBP1Regs.HWBP_CNTL.bit.RTOSINT 	= hwbpCfg.RTOSINT;
	}else if(hwbpInstance == HWBP2_INST)
	{
		EradHWBP2Regs.HWBP_CNTL.bit.BUS_SEL 	= hwbpCfg.BUS_SEL;
		EradHWBP2Regs.HWBP_CNTL.bit.COMP_MODE 	= hwbpCfg.COMP_MODE;
		EradHWBP2Regs.HWBP_REF 				= hwbpCfg.REF;
		EradHWBP2Regs.HWBP_MASK 				= hwbpCfg.MASK;
		EradHWBP2Regs.HWBP_CNTL.bit.STOP 		= hwbpCfg.DBGEVT;
		EradHWBP2Regs.HWBP_CNTL.bit.RTOSINT 	= hwbpCfg.RTOSINT;
	}else if(hwbpInstance == HWBP3_INST)
	{
		EradHWBP3Regs.HWBP_CNTL.bit.BUS_SEL 	= hwbpCfg.BUS_SEL;
		EradHWBP3Regs.HWBP_CNTL.bit.COMP_MODE 	= hwbpCfg.COMP_MODE;
		EradHWBP3Regs.HWBP_REF 				= hwbpCfg.REF;
		EradHWBP3Regs.HWBP_MASK 				= hwbpCfg.MASK;
		EradHWBP3Regs.HWBP_CNTL.bit.STOP 		= hwbpCfg.DBGEVT;
		EradHWBP3Regs.HWBP_CNTL.bit.RTOSINT 	= hwbpCfg.RTOSINT;
	}else if(hwbpInstance == HWBP4_INST)
	{
		EradHWBP4Regs.HWBP_CNTL.bit.BUS_SEL 	= hwbpCfg.BUS_SEL;
		EradHWBP4Regs.HWBP_CNTL.bit.COMP_MODE 	= hwbpCfg.COMP_MODE;
		EradHWBP4Regs.HWBP_REF 				= hwbpCfg.REF;
		EradHWBP4Regs.HWBP_MASK 				= hwbpCfg.MASK;
		EradHWBP4Regs.HWBP_CNTL.bit.STOP 		= hwbpCfg.DBGEVT;
		EradHWBP4Regs.HWBP_CNTL.bit.RTOSINT 	= hwbpCfg.RTOSINT;
	}else if(hwbpInstance == HWBP5_INST)
	{
		EradHWBP5Regs.HWBP_CNTL.bit.BUS_SEL 	= hwbpCfg.BUS_SEL;
		EradHWBP5Regs.HWBP_CNTL.bit.COMP_MODE 	= hwbpCfg.COMP_MODE;
		EradHWBP5Regs.HWBP_REF 				= hwbpCfg.REF;
		EradHWBP5Regs.HWBP_MASK 				= hwbpCfg.MASK;
		EradHWBP5Regs.HWBP_CNTL.bit.STOP 		= hwbpCfg.DBGEVT;
		EradHWBP5Regs.HWBP_CNTL.bit.RTOSINT 	= hwbpCfg.RTOSINT;
	}else if(hwbpInstance == HWBP6_INST)
	{
		EradHWBP6Regs.HWBP_CNTL.bit.BUS_SEL 	= hwbpCfg.BUS_SEL;
		EradHWBP6Regs.HWBP_CNTL.bit.COMP_MODE 	= hwbpCfg.COMP_MODE;
		EradHWBP6Regs.HWBP_REF 				= hwbpCfg.REF;
		EradHWBP6Regs.HWBP_MASK 				= hwbpCfg.MASK;
		EradHWBP6Regs.HWBP_CNTL.bit.STOP 		= hwbpCfg.DBGEVT;
		EradHWBP6Regs.HWBP_CNTL.bit.RTOSINT 	= hwbpCfg.RTOSINT;
	}else if(hwbpInstance == HWBP7_INST)
	{
		EradHWBP7Regs.HWBP_CNTL.bit.BUS_SEL 	= hwbpCfg.BUS_SEL;
		EradHWBP7Regs.HWBP_CNTL.bit.COMP_MODE 	= hwbpCfg.COMP_MODE;
		EradHWBP7Regs.HWBP_REF 				= hwbpCfg.REF;
		EradHWBP7Regs.HWBP_MASK 				= hwbpCfg.MASK;
		EradHWBP7Regs.HWBP_CNTL.bit.STOP 		= hwbpCfg.DBGEVT;
		EradHWBP7Regs.HWBP_CNTL.bit.RTOSINT 	= hwbpCfg.RTOSINT;
	}else if(hwbpInstance == HWBP8_INST)
	{
		EradHWBP8Regs.HWBP_CNTL.bit.BUS_SEL 	= hwbpCfg.BUS_SEL;
		EradHWBP8Regs.HWBP_CNTL.bit.COMP_MODE 	= hwbpCfg.COMP_MODE;
		EradHWBP8Regs.HWBP_REF 				= hwbpCfg.REF;
		EradHWBP8Regs.HWBP_MASK 				= hwbpCfg.MASK;
		EradHWBP8Regs.HWBP_CNTL.bit.STOP 		= hwbpCfg.DBGEVT;
		EradHWBP8Regs.HWBP_CNTL.bit.RTOSINT 	= hwbpCfg.RTOSINT;
	}
	EDIS;
}

